### Pandas SQL Relations

In [1]:
import pandas as pd

In [2]:
'Begin querying'

"CREATE TABLE books (id INTEGER PRIMARY KEY, name TEXT, rating INTEGER);"
book_df = pd.DataFrame(columns=['name', 'rating'])

"INSERT INTO books VALUES (1, 'great_5star', 5);"
book_df.loc[0] = ['great_5star', 5]

"INSERT INTO books VALUES (2, 'good_4star', 4);"
book_df.loc[1] = ['good_4star', 4]

"INSERT INTO books VALUES (3, 'okay_3star', 3);"
book_df.loc[2] = ['good_3star', 3]

book_df

'Begin querying'

'CREATE TABLE books (id INTEGER PRIMARY KEY, name TEXT, rating INTEGER);'

"INSERT INTO books VALUES (1, 'great_5star', 5);"

"INSERT INTO books VALUES (2, 'good_4star', 4);"

"INSERT INTO books VALUES (3, 'okay_3star', 3);"

          name rating
0  great_5star      5
1   good_4star      4
2   good_3star      3

In [3]:
'Setup'
movie_df = pd.DataFrame({'release_year': [1998, 2002, 2000], 'name': ['movie1', 'movie2', 'movie3']})

'Begin querying'
'SELECT * from movies WHERE release_year >= 2000 ORDER BY release_year'
movie_df.loc[(movie_df['release_year'] >= 2000)].sort_values('release_year')

'Setup'

'Begin querying'

'SELECT * from movies WHERE release_year >= 2000 ORDER BY release_year'

     name  release_year
2  movie3          2000
1  movie2          2002

In [4]:
'Setup'
todo_list_df = pd.DataFrame({'minutes': [5, 10, 15], 'todo': ['play', 'sit', 'breathe']})

'Begin querying'
'SELECT SUM(minutes) FROM todo_list'
todo_list_df['minutes'].sum()

'Setup'

'Begin querying'

'SELECT SUM(minutes) FROM todo_list'

30

In [5]:
'Setup'
songs_df = pd.DataFrame({'title': ['queens_song1', 'andrews_song', 'queens_song2', 'yolos_song'],
                         'artist': ['Queen', 'Andrew', 'Queen', 'Yolo']})

artists_df = pd.DataFrame({'name': ['Queen', 'Andrew', 'Yolo'],
                           'genre': ['Rock', 'Pop', 'Pop']})

songs_df
artists_df

'Begin Querying'
"SELECT title FROM songs WHERE artist = 'Queen';"
songs_df['title'].loc[songs_df['artist'] == 'Queen']

"SELECT name FROM artists WHERE genre = 'Pop';"
artists_df['name'].loc[artists_df['genre'] == 'Pop']

"SELECT title FROM songs WHERE artist in (SELECT name FROM artists WHERE genre = 'Pop');"
songs_df['title'].loc[songs_df['artist'].isin(artists_df['name'].loc[artists_df['genre'] == 'Pop'])]

'Setup'

   artist         title
0   Queen  queens_song1
1  Andrew  andrews_song
2   Queen  queens_song2
3    Yolo    yolos_song

  genre    name
0  Rock   Queen
1   Pop  Andrew
2   Pop    Yolo

'Begin Querying'

"SELECT title FROM songs WHERE artist = 'Queen';"

0    queens_song1
2    queens_song2
Name: title, dtype: object

"SELECT name FROM artists WHERE genre = 'Pop';"

1    Andrew
2      Yolo
Name: name, dtype: object

"SELECT title FROM songs WHERE artist in (SELECT name FROM artists WHERE genre = 'Pop');"

1    andrews_song
3      yolos_song
Name: title, dtype: object

In [6]:
'Setup'
book_df = pd.DataFrame({'words': [500000, 500001, 500000, 500001],
                        'title': ['andrews_book1', 'mengs_book1', 'andrews_book2', 'mengs_book2'],
                        'author': ['Andrew', 'Meng', 'Andrew', 'Meng']})
book_df

'Begin Querying'
"SELECT author, SUM(words) as total_words from books GROUP BY author HAVING total_words > 1000000;"
word_sum = book_df.rename(columns={'words': 'total_words'}).groupby('author').sum()
word_sum[word_sum['total_words'] > 1000000]

"SELECT author, AVG(words) as avg_words from books GROUP BY author HAVING avg_words > 150000;"
word_avg = book_df.rename(columns={'words': 'avg_words'}).groupby('author').mean()
word_avg[word_avg['avg_words'] > 150000]

'Setup'

   author          title   words
0  Andrew  andrews_book1  500000
1    Meng    mengs_book1  500001
2  Andrew  andrews_book2  500000
3    Meng    mengs_book2  500001

'Begin Querying'

'SELECT author, SUM(words) as total_words from books GROUP BY author HAVING total_words > 1000000;'

        total_words
author
Meng        1000002

'SELECT author, AVG(words) as avg_words from books GROUP BY author HAVING avg_words > 150000;'

        avg_words
author
Andrew     500000
Meng       500001

In [7]:
'Setup'
songs_df = pd.DataFrame({'title': ['queens_song1', 'andrews_song', 'queens_song2', 'yolos_song'],
                         'mood': ['epic', 'crap', 'epic', 'yolo'],
                         'released': [1978, 2002, 2000, 1500],
                         'duration': [60 * 3, 60 * 2, 60 * 5, 60 * 3]})
songs_df

"SELECT title from songs;"
songs_df['title']

"SELECT title from songs WHERE mood = 'epic' OR released > 1990;"
songs_df['title'].loc[(songs_df['mood'] == 'epic') | (songs_df['released'] > 1990)]

"SELECT title from songs WHERE mood='epic' and released > 1990 and duration < 60 * 4;"
songs_df['title'].loc[(songs_df['mood'] == 'epic') & (songs_df['released'] > 1990) & (songs_df['duration'] > 60 * 4)]

'Setup'

   duration  mood  released         title
0       180  epic      1978  queens_song1
1       120  crap      2002  andrews_song
2       300  epic      2000  queens_song2
3       180  yolo      1500    yolos_song

'SELECT title from songs;'

0    queens_song1
1    andrews_song
2    queens_song2
3      yolos_song
Name: title, dtype: object

"SELECT title from songs WHERE mood = 'epic' OR released > 1990;"

0    queens_song1
1    andrews_song
2    queens_song2
Name: title, dtype: object

"SELECT title from songs WHERE mood='epic' and released > 1990 and duration < 60 * 4;"

2    queens_song2
Name: title, dtype: object

In [8]:
'Setup'
grade_df = pd.DataFrame({'name': ['alm', 'fae', 'wat', 'pro'],
                         'number_grade': [76, 51, 32, 99],
                         'fraction_completed': [0.7, 0.5, 0.3, 0.98]})
grade_df

'Begin Querying'

"SELECT name, number_grade, ROUND(fraction_completed * 100) as percent_completed from student_grades;"
grade_df['percent_completed'] = (grade_df['fraction_completed'] * 100).round(0)
grade_df[['name', 'number_grade', 'percent_completed']]

print("""
SELECT COUNT(*),
        CASE
            WHEN number_grade > 90 THEN 'A'
            WHEN number_grade > 80 THEN 'B'
            WHEN number_grade > 70 THEN 'C'
            ELSE 'F'
        END as 'letter_grade'
    FROM student_grades 
GROUP BY letter_grade;
""")

def number_grade_to_letter(number):
    if number > 90:
        grade = 'A'
    elif number > 80:
        grade = 'B'
    elif number > 70:
        grade = 'C'
    else:
        grade = 'F'
    return grade

grade_df['letter_grade'] = grade_df['number_grade'].apply(number_grade_to_letter)
grade_df.groupby('letter_grade').count()

'Setup'

   fraction_completed name  number_grade
0                0.70  alm            76
1                0.50  fae            51
2                0.30  wat            32
3                0.98  pro            99

'Begin Querying'

'SELECT name, number_grade, ROUND(fraction_completed * 100) as percent_completed from student_grades;'

  name  number_grade  percent_completed
0  alm            76               70.0
1  fae            51               50.0
2  wat            32               30.0
3  pro            99               98.0

SELECT COUNT(*),
        CASE
            WHEN number_grade > 90 THEN 'A'
            WHEN number_grade > 80 THEN 'B'
            WHEN number_grade > 70 THEN 'C'
            ELSE 'F'
        END as 'letter_grade'
    FROM student_grades
GROUP BY letter_grade;

              fraction_completed  name  number_grade  percent_completed
letter_grade
A                              1     1             1                  1
C                              1     1             1                  1
F                              2     2             2                  2

In [9]:
'Setup'
persons_df = pd.DataFrame({'name': ['Bobby McBobbyFace'],
                           'age': [25]})
hobbies_df = pd.DataFrame({'person_id': [0], 'name': ['being Bobby']})

persons_df
hobbies_df

'Begin Querying'

"INSERT INTO persons (name, age) VALUES  ('Andrew', 22);"
persons_df.loc[1, ['name', 'age']] = ['Andrew', 22]
persons_df

"INSERT INTO hobbies (person_id, name) VALUES (1, 'programming');"
hobbies_df.loc[1, ['person_id', 'name']] = [1, 'programming']
hobbies_df

"SELECT persons.name, hobbies.name from persons JOIN hobbies ON persons.id = hobbies.person_id;"
hobbies_df.set_index('person_id').join(persons_df, lsuffix='_hobbies', how='inner')[['name', 'name_hobbies']]

"SELECT persons.name, hobbies.name from persons JOIN hobbies ON persons.id = hobbies.person_id WHERE persons.name = 'Bobby McBobbyFace';"
hobbies_df.set_index('person_id').join(persons_df.loc[persons_df['name'] == 'Bobby McBobbyFace'], lsuffix='_hobbies', how='inner')[['name', 'name_hobbies']]

'Setup'

   age               name
0   25  Bobby McBobbyFace

          name  person_id
0  being Bobby          0

'Begin Querying'

"INSERT INTO persons (name, age) VALUES  ('Andrew', 22);"

    age               name
0  25.0  Bobby McBobbyFace
1  22.0             Andrew

"INSERT INTO hobbies (person_id, name) VALUES (1, 'programming');"

          name  person_id
0  being Bobby        0.0
1  programming        1.0

'SELECT persons.name, hobbies.name from persons JOIN hobbies ON persons.id = hobbies.person_id;'

                        name name_hobbies
person_id
0.0        Bobby McBobbyFace  being Bobby
1.0                   Andrew  programming

"SELECT persons.name, hobbies.name from persons JOIN hobbies ON persons.id = hobbies.person_id WHERE persons.name = 'Bobby McBobbyFace';"

                name name_hobbies
0  Bobby McBobbyFace  being Bobby

In [10]:
"Setup"
movie_df = pd.DataFrame({'release_year': [1998, 2002, 2004],
                         'title': ['movie1', 'movie2', 'movie3'],
                         'sequel_id': [1, 2, 3]})
movie_df

"Begin Querying"

"SELECT movies.title, sequels.title FROM movies LEFT OUTER JOIN movies as sequels ON movies.sequel_id = sequels.id"
movie_df.set_index('sequel_id').join(movie_df, rsuffix='_sequel')[['title', 'title_sequel']]

'Setup'

   release_year  sequel_id   title
0          1998          1  movie1
1          2002          2  movie2
2          2004          3  movie3

'Begin Querying'

'SELECT movies.title, sequels.title FROM movies LEFT OUTER JOIN movies as sequels ON movies.sequel_id = sequels.id'

            title title_sequel
sequel_id
1          movie1       movie2
2          movie2       movie3
3          movie3          NaN

In [11]:
"Setup"
documents_df = pd.DataFrame({'title': ["Jackie Doc", "Things I'm Afraid Of"],
                             'author': ['Jackie Paper', 'Scary Author']})
documents_df

"Begin Querying"

"UPDATE documents SET author = 'Jackie Draper' WHERE author = 'Jackie Paper';"
documents_df.loc[documents_df['author'] == 'Jackie Paper', 'author'] = 'Jackie Draper'
documents_df

"""DELETE FROM documents WHERE title = "Things I'm Afraid Of";"""
documents_df = documents_df.loc[documents_df['title'] != "Things I'm Afraid Of"]
documents_df

'Setup'

         author                 title
0  Jackie Paper            Jackie Doc
1  Scary Author  Things I'm Afraid Of

'Begin Querying'

"UPDATE documents SET author = 'Jackie Draper' WHERE author = 'Jackie Paper';"

          author                 title
0  Jackie Draper            Jackie Doc
1   Scary Author  Things I'm Afraid Of

'DELETE FROM documents WHERE title = "Things I\'m Afraid Of";'

          author       title
0  Jackie Draper  Jackie Doc

In [12]:
# most confusing

'Setup'
persons_df = pd.DataFrame({'fullname': ['Andrew', 'Bob', 'Joe', 'Ela']})
friends_df = pd.DataFrame({'person1_id': [0, 1], 'person2_id': [3, 2]})

'Begin querying'

print("""
SELECT friend1.fullname, friend2.fullname
FROM friends
JOIN persons as friend1
ON friends.person1_id = friend1.id
JOIN persons as friend2
ON friends.person2_id = friend2.id;
""")

# unsure how to do this in pandas

'Setup'

'Begin querying'

SELECT friend1.fullname, friend2.fullname
FROM friends
JOIN persons as friend1
ON friends.person1_id = friend1.id
JOIN persons as friend2
ON friends.person2_id = friend2.id;

In [13]:
"Setup"
customers_df = pd.DataFrame({'name': ['Andrew', 'Unreal'],
                             'email': ['andrew.zeth.ahh@gmail.com', 'notrealemail@gmail.com']})
orders_df = pd.DataFrame({'item': ['computer', 'camera'], 'price': [750, 400], 'customer_id': [0, 0]})

"Begin Querying"
"SELECT customers.name, customers.email, orders.item, orders.price from customers LEFT OUTER JOIN orders ON customers.id = orders.customer_id;"
customers_df.join(orders_df.set_index('customer_id'), how='left')

"SELECT customers.name, customers.email, SUM(orders.price) from customers LEFT OUTER JOIN orders ON customers.id = orders.customer_id GROUP BY customers.id"
customers_df.join(orders_df.set_index('customer_id'), how='left').groupby('email').agg({'name': 'first', 'price': 'sum'})

'Setup'

'Begin Querying'

'SELECT customers.name, customers.email, orders.item, orders.price from customers LEFT OUTER JOIN orders ON customers.id = orders.customer_id;'

                       email    name      item  price
0  andrew.zeth.ahh@gmail.com  Andrew  computer  750.0
0  andrew.zeth.ahh@gmail.com  Andrew    camera  400.0
1     notrealemail@gmail.com  Unreal       NaN    NaN

'SELECT customers.name, customers.email, SUM(orders.price) from customers LEFT OUTER JOIN orders ON customers.id = orders.customer_id GROUP BY customers.id'

                             name   price
email
andrew.zeth.ahh@gmail.com  Andrew  1150.0
notrealemail@gmail.com     Unreal     0.0

In [14]:
"Setup"
clothes_df = pd.DataFrame(columns=['type', 'design'])
clothes_df.loc[0] = ['pants', 'green']
clothes_df.loc[1] = ['hoodie', 'orange']
clothes_df.loc[2] = ['shoes', 'grey']

"Begin Querying"

"ALTER TABLE clothes ADD price numeric default 'unknown;"
clothes_df['price'] = 'unknown'
clothes_df

print("""
UPDATE clothes SET price = 10 where id = 0;
UPDATE clothes SET price = 20 where id = 1;
UPDATE clothes SET price = 30 where id = 2;
""")
clothes_df['price'] = [10, 20, 30]
clothes_df

"INSERT INTO clothes (id, type, design, price) VALUES (4, 'jacket', 'black', 40);"
clothes_df.loc[3] = (['jacket', 'black', 40])

clothes_df

'Setup'

'Begin Querying'

"ALTER TABLE clothes ADD price numeric default 'unknown;"

     type  design    price
0   pants   green  unknown
1  hoodie  orange  unknown
2   shoes    grey  unknown

UPDATE clothes SET price = 10 where id = 0;
UPDATE clothes SET price = 20 where id = 1;
UPDATE clothes SET price = 30 where id = 2;

     type  design  price
0   pants   green     10
1  hoodie  orange     20
2   shoes    grey     30

"INSERT INTO clothes (id, type, design, price) VALUES (4, 'jacket', 'black', 40);"

     type  design  price
0   pants   green     10
1  hoodie  orange     20
2   shoes    grey     30
3  jacket   black     40